#include <bits/stdc++.h>
using namespace std;
/*
Напиши програм који одређује последње три цифре збира и последње три цифре производа четири унета цела броја.

Улаз
У сваком реду стандардног улаза уноси се по један цео број из интервала [1..999].

Излаз
На стандардни излаз се исписују број одређен са последње три цифре збира 
и број одређен са последње три цифре производа унетих бројева (евентуалне водеће нуле се не морају исписати).
*/


int main() {
    int m = 1000;
    int a, b, c, d; cin >> a >> b >> c >> d;

    // a %= 1000; b %= 1000; c %= 1000; d %= 1000; 

    cout << ( a + b + c + d ) % 1000 << '\n';
    cout << ( (a * b)%m * (c * d)%m ) % 1000;





    return 0;
}